##########################################################
# Projet Méthodes Statistiques appliquées à la Finance

# Ruimy Benjamin
# Voong Kwan
# Ibakuyumcu Arnaud

# Script R utilisé pour répondre aux questions du Sujet
##########################################################

load("data/RentJAPDOWA.RData")

#******************************************************
## Question 1 : Distribution empirique des rentabilités
#******************************************************







#******************************************************
## Question 2 : Dépendance linéaire des rentabilités
#******************************************************











#******************************************************
## Question 3 : Étude du modèle de Markov HMM
#******************************************************











#******************************************************
## Question 4 : Espérance des rentabilités journalières
#******************************************************









#******************************************************
## Question 5 : Corrélation des abs et carré des rentas
#******************************************************













#******************************************************
## Question 6 : Modélisation de type ARCH
#******************************************************













#******************************************************
## Question 7 : Performance prédictive du modèle
#******************************************************











#******************************************************
## Question 8 : Stabilité du modèle
#******************************************************
